tutorials/heatTransfer/buoyantSimpleFoam/buoyantCavity/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 3.75e-04;

boundaryField
{
    frontAndBack
    {
        type            kqRWallFunction;
        value           uniform 3.75e-04;
    }

    topAndBottom
    {
        type            kqRWallFunction;
        value           uniform 3.75e-04;
    }

    hot
    {
        type            kqRWallFunction;
        value           uniform 3.75e-04;
    }

    cold
    {
        type            kqRWallFunction;
        value           uniform 3.75e-04;
    }
}


// ************************************************************************* //
